const rankOptions = [
    { key: 'معلم', value: 'معلم', text: 'معلم' },
    { key: 'أستاذ مساعد', value: 'أستاذ مساعد', text: 'أستاذ مساعد' },
    { key: 'أستاذ مشارك', value: 'أستاذ مشارك', text: 'أستاذ مشارك' },
    { key: 'أستاذ جامعي', value: 'أستاذ جامعي', text: 'أستاذ جامعي' },
]


const collegeOptions = [
    { key: 'IT', value: 'تكنولوجيا المعلومات', text: 'تكنولوجيا المعلومات' },
    { key: 'FinanceAndBusiness', value: 'المال والأعمال', text: 'المال والأعمال' },
    { key: 'ShariaAndLaw', value: 'الشيخ نوح القضاة للشريعة والقانون', text: 'الشيخ نوح القضاة للشريعة والقانون' },
    { key: 'ArtsAndSciences', value: 'الآداب والعلوم', text: 'الآداب والعلوم' },
    { key: 'EducationalSciences', value: 'العلوم التربوية', text: 'العلوم التربوية' },
    { key: 'IslamicArtandArchitecture', value: 'الفنون والعمارة الإسلامية', text: 'الفنون والعمارة الإسلامية' },
    { key: 'Dawah', value: 'كلية الدعوة وأصول الدين', text: 'كلية الدعوة وأصول الدين' },
    { key: 'Maliki', value: 'الفقه المالكي', text: 'الفقه المالكي' },
    { key: 'Hanafi', value: 'الفقه الشافعي', text: 'الفقه الشافعي' },
    { key: 'Shafi', value: 'الفقه الحنفي', text: 'الفقه الحنفي' },
]

const sectionOptions = {
    IT: [
        { key: 'علم الحاسوب', value: 'علم الحاسوب', text: 'علم الحاسوب' },
        { key: 'هندسة البرمجيات', value: 'هندسة البرمجيات', text: 'هندسة البرمجيات' },
        { key: 'نظم المعلومات والشبكات', value: 'نظم المعلومات والشبكات', text: 'نظم المعلومات والشبكات' },
        { key: 'آمن المعلومات', value: 'آمن المعلومات', text: 'آمن المعلومات' },
    ],
    FinanceAndBusiness: [
        { key: 'الادارة', value: 'الادارة', text: 'الادارة' },
        { key: 'المصارف الاسلامية', value: 'المصارف الاسلامية', text: 'المصارف الاسلامية' },
        { key: 'نظم المعلومات الإدارية', value: 'نظم المعلومات الإدارية', text: 'نظم المعلومات الإدارية' },
        { key: 'المحاسبة', value: 'المحاسبة', text: 'المحاسبة' },
        { key: 'العلوم المالية والمصرفية', value: 'العلوم المالية والمصرفية', text: 'العلوم المالية والمصرفية' },
    ],
    ArtsAndSciences: [
        { key: 'التاريخ والحضارة الإسلامية', value: 'التاريخ والحضارة الإسلامية', text: 'التاريخ والحضارة الإسلامية' },
        { key: 'اللغة العربية وآدابها', value: 'اللغة العربية وآدابها', text: 'اللغة العربية وآدابها' },
        { key: 'اللغة الإنجليزية', value: 'اللغة الإنجليزية', text: 'اللغة الإنجليزية' },
        { key: 'العلوم الإنسانية', value: 'العلوم الإنسانية', text: 'العلوم الإنسانية' },
        { key: 'الخدمات الأكاديمية', value: 'الخدمات الأكاديمية', text: 'الخدمات الأكاديمية' },
    ],
    ShariaAndLaw: [
        { key: 'الفقه وأصوله', value: 'الفقه وأصوله', text: 'الفقه وأصوله' },
        { key: 'القانون المقارن', value: 'القانون المقارن', text: 'القانون المقارن' },
    ],
    EducationalSciences: [
        { key: 'الإرشاد والصحة النفسية', value: 'الإرشاد والصحة النفسية', text: 'الإرشاد والصحة النفسية' },
        { key: 'التربية الخاصة', value: 'التربية الخاصة', text: 'التربية الخاصة' },
        { key: 'المناهج والتدريس', value: 'المناهج والتدريس', text: 'المناهج والتدريس' },
    ],
    IslamicArtandArchitecture: [
        { key: 'الفنون الإسلامية والتطبيقية', value: 'الفنون الإسلامية والتطبيقية', text: 'الفنون الإسلامية والتطبيقية' },
    ],
    Dawah: [
        { key: 'أصول الدين', value: 'أصول الدين', text: 'أصول الدين' },
        { key: 'القراءات والدراسات القرآنية', value: 'القراءات والدراسات القرآنية', text: 'القراءات والدراسات القرآنية' },
        { key: 'الدعوة والإعلام الإسلامي', value: 'الدعوة والإعلام الإسلامي', text: 'الدعوة والإعلام الإسلامي' },
    ],
    Maliki: [
        { key: 'الفقه المالكي', value: 'الفقه المالكي', text: 'الفقه المالكي' },
    ],
    Hanafi: [
        { key: 'الفقه الحنفي', value: 'الفقه الحنفي', text: 'الفقه الحنفي' },
        { key: 'القضاء والإفتاء الشرعي', value: 'القضاء والإفتاء الشرعي', text: 'القضاء والإفتاء الشرعي' },
        { key: 'الإصلاح والوفاق الأسري الشرعي', value: 'الإصلاح والوفاق الأسري الشرعي', text: 'الإصلاح والوفاق الأسري الشرعي' },
    ],
    Shafi: [
        { key: 'الفقه الشافعي', value: 'الفقه الشافعي', text: 'الفقه الشافعي' },
    ]
}

const ranks = {
    0: "صاحب طلب الترقية",
    1: "رئيس القسم",
    2: "العميد",
    3: "رئاسة الجامعة",
    4: "أمانة سر المجالس",
    5: "لجنة التعين والترقية"
}

const research_types = [
    { key: 'alone', value: 'منفرد', text: 'منفرد' },
    { key: 'not alone', value: 'غير منفرد', text: 'غير منفرد' },
]

const is_research_specialty = [
    { key: 'yes', value: true, text: 'نعم' },
    { key: 'no', value: false, text: 'لا' },
]

const memberDecision = {
    "approved": "تم الموافقة على الطلب",
    "rejected": "لم يتم الموافقة على الطلب"
}

const wise_administratives_ranks = [
    { key: 'أمانة سر المجالس', value: 'أمانة سر المجالس', text: 'أمانة سر المجالس' },
    { key: 'لجنة التعين والترقية', value: 'لجنة التعين والترقية', text: 'لجنة التعين والترقية' },
    { key: 'رئاسة الجامعة', value: 'رئاسة الجامعة', text: 'رئاسة الجامعة' },
]

export {
    rankOptions,
    collegeOptions,
    sectionOptions,
    ranks,
    research_types,
    is_research_specialty,
    memberDecision,
    wise_administratives_ranks
}